In [4]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

In [22]:
df=pd.read_csv("Structured_data.csv")

In [5]:
Get all the Earth meteorites that fell before the year 2000
● Get all the earth meteorites co-ordinates who fell before the year 1970
● Assuming that the mass of the earth meteorites was in kg, get all those whose mass was more
than 10000kg

SyntaxError: invalid character '●' (U+25CF) (465752939.py, line 2)

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 959 entries, 0 to 958
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   name         959 non-null    object
 1   id           959 non-null    int64
 2   nametype     959 non-null    object
 3   recclass     959 non-null    object
 4   mass         959 non-null    float64
 5   fall         959 non-null    object
 6   year         948 non-null    object
 7   reclat       959 non-null    float64
 8   reclong      959 non-null    float64
 9   geolocation  959 non-null    object
dtypes: float64(3), int64(1), object(6)
memory usage: 75.0+ KB

In [24]:
df_new=df.dropna()

df_new[df_new.year.apply(lambda X: int(str(X).split("-")[0])<2000)].name  #all the Earth meteorites that fell before the year 2000

0         Aachen
1         Aarhus
2           Abee
3       Acapulco
4        Achiras
         ...
953     Timochin
954     Tirupati
956        Tjabe
957     Tjerebon
958    Tomakovka
Name: name, Length: 882, dtype: object

In [29]:
#all the earth meteorites co-ordinates who fell before the year 1970
df_new[df_new.year.apply(lambda X: int(str(X).split("-")[0])<1970)].geolocation

0         [6, 50]
1        [10, 56]
2      [-113, 54]
4      [-64, -33]
5        [71, 32]
          ...
953      [35, 54]
954      [79, 13]
956     [111, -7]
957     [106, -6]
958      [34, 47]
Name: geolocation, Length: 739, dtype: object

In [33]:
#all those whose mass was more than 10000kg
df[df.mass > 10000] # these all have mass more that 10000 kg

,name,id,nametype,recclass,mass,fall,year,reclat,reclong,geolocation
2,Abee,6,Valid,EH4,107000.0,Fell,1952-01-01,54.21667,-113.00000,"[-113, 54]"
7,Agen,392,Valid,H5,30000.0,Fell,1814-01-01,44.21667,0.61667,"[0, 44]"
11,Aïr,424,Valid,L6,24000.0,Fell,1925-01-01,19.08333,8.38333,"[8, 19]"
15,Akyumak,433,Valid,"Iron, IVA",50000.0,Fell,1981-01-01,39.91667,42.81667,"[42, 39]"
26,Alfianello,466,Valid,L6,228000.0,Fell,1883-01-01,45.26667,10.15000,"[10, 45]"
...,...,...,...,...,...,...,...,...,...,...
950,Tieschitz,23989,Valid,H/L3.6,28000.0,Fell,1878-01-01,49.60000,17.11667,"[17, 49]"
951,Tilden,23998,Valid,L6,74800.0,Fell,1927-01-01,38.20000,-89.68333,"[-89, 38]"
953,Timochin,24004,Valid,H5,65500.0,Fell,1807-01-01,54.50000,35.20000,"[35, 54]"
956,Tjabe,24011,Valid,H6,20000.0,Fell,1869-01-01,-7.08333,111.53333,"[111, -7]"
957,Tjerebon,24012,Valid,L5,16500.0,Fell,1922-01-01,-6.66667,106.58333,"[106, -6]"